#include "drv_delay.h"


// 使用定时器10作硬件延时，时钟频率为系统时钟频率/8，即20MHz，但给定时器用时为40MHz
//============================================================================
// 名称：drv_delay_init
// 功能：延时功能初始化
// 参数：无
// 返回：无
// 说明：每us计数器值加1
//============================================================================
void drv_delay_init( void )
{
    RCC->APB2ENR |= RCC_APB2ENR_TIM10EN;                 // 使能定时器10外设时钟
    RCC->AHB2RSTR |= RCC_APB2RSTR_TIM10RST;              // 复位定时器10
    DBGMCU_APB2PeriphConfig(DBGMCU_TIM10_STOP, ENABLE);  // 调试时定时器停止计数
}

//============================================================================
// 名称：drv_delay_ms
// 功能：ms级延时
// 参数：nms：要延时的毫秒数
// 返回：无
// 说明：最大65535ms
//============================================================================
void drv_delay_ms( INT32U nms )
{
    if( nms > 65535 )
    {
        nms = 65535;
    }
    TIM10->PSC = 39999;
    TIM10->CNT = 0;
    TIM10->ARR = nms;
    TIM10->CR1 = 0x01;                  // 开始计数
    while ( 0 == (TIM10->SR) );
    TIM10->CR1 = 0;                     // 停止计数
    TIM10->SR = 0;
}

//============================================================================
// 名称：drv_delay_us
// 功能：us级延时
// 参数：nus
// 返回：无
// 说明：最大65635us
//============================================================================
void drv_delay_us( INT32U nus )
{
    if( nus > 65535 )
    {
        nus = 65535;
    }

    TIM10->CNT = 0;
    TIM10->PSC = 39;
    TIM10->ARR = nus;
    TIM10->CR1 = 0x01;                  // 开始计数

    while ( 0 == (TIM10->SR) );
    TIM10->CR1 = 0;                     // 停止计数
    TIM10->SR = 0;
}

//============================================================================
// 名称：drv_delay
// 功能：简单软件延时
// 参数：nCount：延时值
// 返回：无
// 说明：不精确，一般用于很短时间延时
//============================================================================
void drv_delay( INT32U nCount )
{
    while ( --nCount );
}








